n,m = map(int, input().split())

arr = [
    [0 for _ in range(m)]
    for _ in range(n)
]

# 4,6
# [0][0], [0][1] [1][0], [0][2] [1][1] [2][0], [0][3] [1][2] [2][1] [3][0], [0][4] [1][3] [2][2] [3][1], // [1][5] [2][4] [3][3], [2][5] [3][4], [3][5] 
# [0][0], [0][1] [1][0], [0][2] [1][1] [2][0], //  [1][2] [2][1], [2][2]
# 규칙이 뭘까?
num = 1
for i in range(m):
    # m번의 대각선을 돈다.
    for j in range(i+1):
        # j가 1, 2, 3, 4, 5, 6이 됩니다.
        # 근데 ! n보다 작거나 같을때까지만 돕니다.
        if j<n:
            arr[j][i] = num # [0][0], [0][1] [1][0], [0][2] [1][1] [2][0], [0][3] [1][2] [2][1] [3][0], [0][4] [1][3] [2][2] [3][1] [4][0]
            i -= 1
            num += 1
        else:
            pass
            

for i in range(1,n):
    for j in range(m-1, -1, -1):
        if i<n:
            arr[i][j] = num #[1][5] [2][4] [3][3] // [2][5] [3][4] ||| [1][3]
            i += 1 
            num += 1
        else:
            pass

for row in arr:
    for elem in row:
        print(elem, end=" ")
    print()